## leetcode 180 Consecutive Numbers

Write a SQL query to find all numbers that appear at least three times consecutively.

+----+-----+
| Id | Num |
+----+-----+
| 1  |  1  |
| 2  |  1  |
| 3  |  1  |
| 4  |  2  |
| 5  |  1  |
| 6  |  2  |
| 7  |  2  |
+----+-----+
For example, given the above Logs table, 1 is the only number that appears consecutively for at least three times.

+-----------------+
| ConsecutiveNums |
+-----------------+
| 1               |
+-----------------+

In [195]:
import pandas as pd
Log = pd.DataFrame({'Id':[1,2,3,4,5,6,7],
                    'Num':[1,1,1,2,1,2,2]})
Log

   Id  Num
0   1    1
1   2    1
2   3    1
3   4    2
4   5    1
5   6    2
6   7    2

In [196]:
Log['A1']=Log['Num'].shift(-1)
Log['A1'] = Log['A1'].fillna(999).astype(int)
Log

   Id  Num   A1
0   1    1    1
1   2    1    1
2   3    1    2
3   4    2    1
4   5    1    2
5   6    2    2
6   7    2  999

In [197]:
Log['A2']=Log['Num'].shift(-2)
Log['A2'] = Log['A2'].fillna(999).astype(int)
Log

   Id  Num   A1   A2
0   1    1    1    1
1   2    1    1    2
2   3    1    2    1
3   4    2    1    2
4   5    1    2    2
5   6    2    2  999
6   7    2  999  999

In [198]:
Log[(Log.Num==Log['A1'])&(Log.Num==Log['A2'])]

   Id  Num  A1  A2
0   1    1   1   1

In [199]:
Log[(Log.Num==Log['A1'])&(Log.Num==Log['A2'])].Num

0    1
Name: Num, dtype: int64

In [200]:
loganswer=pd.DataFrame([set(Log[(Log.Num==Log['A1'])&(Log.Num==Log['A2'])].Num)],
                    columns=['ConsecutiveNums'])
loganswer

   ConsecutiveNums
0                1

In [201]:
print(loganswer.to_string(index=False))

ConsecutiveNums
              1

In [202]:
loganswer.set_index('ConsecutiveNums',inplace=True)
loganswer

Empty DataFrame
Columns: []
Index: [1]